bench/results/baseline-20260427-015854/A-tiny-throughput-c4m100.txt
starting benchmark...
spawning thread #0: 1 total client(s). Timing-based test with 2s of warm-up time and 15s of main duration for measurements.
spawning thread #1: 1 total client(s). Timing-based test with 2s of warm-up time and 15s of main duration for measurements.
spawning thread #2: 1 total client(s). Timing-based test with 2s of warm-up time and 15s of main duration for measurements.
spawning thread #3: 1 total client(s). Timing-based test with 2s of warm-up time and 15s of main duration for measurements.
Warm-up started for thread #2.
Warm-up started for thread #0.
progress: 100% of clients started
Warm-up started for thread #1.
Warm-up started for thread #3.
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #2.
Main benchmark duration is started for thread #2.
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1

finished in 17.00s, 189739.53 req/s, 16.83MB/s
requests: 2846093 total, 2846093 started, 2846093 done, 2846093 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 2846093 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 252.42MB (264686649) total, 196.43MB (205970240) headers (space savings 40.74%), 6.14MB (6436570) data
                     min         max         mean         sd        +/- sd
time for request:       36us      8.02ms      2.05ms       868us    69.40%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :   47138.93    47579.14    47433.35      199.16    75.00%